wakayamarb/wrbb-v2lib-firm/firmware_release/gr_common/core/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA

  $Id: wiring.h 249 2007-02-03 16:52:51Z mellis $
*/
/*
  Modified 13 July 2014 by Nozomu Fujita
*/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#ifndef __RX600__
#include <avr/pgmspace.h>
#else /*__RX600__*/
#include "rx63n/typedefine.h"
#endif/*__RX600__*/

#define NUM_DIGITAL_PINS            66
#ifndef __RX600__
#define NUM_ANALOG_INPUTS           8
#else /*__RX600__*/
#define NUM_ANALOG_INPUTS           16
#endif/*__RX600__*/
/** Invalid pin/port/bitmask. */
#define INVALID_IO (-1)

#define analogInputToDigitalPin(p)  ((p < 6) ? (p) + 14 : -1)

#if defined(GRSAKURA)
#define digitalPinHasPWM(p)         ((p) == 0 || (p) == 1 || (p) == 2 || (p) == 3 || (p) == 4 || \
                                     (p) == 5 || (p) == 6 || (p) == 7 || (p) == 9 || (p) == 10 || (p) == 11 \
                                    )
#elif defined(GRCITRUS)
#define digitalPinHasPWM(p)         ((p) == 0 || (p) == 1 || (p) == 5 || (p) == 7 || (p) == 8 || (p) == 11)
#elif defined(__AVR_ATmega8__)
#define digitalPinHasPWM(p)         ((p) == 9 || (p) == 10 || (p) == 11)
#else
#define digitalPinHasPWM(p)         ((p) == 3 || (p) == 5 || (p) == 6 || (p) == 9 || (p) == 10 || (p) == 11)
#endif

static const uint8_t SS   = 10; // 22 is used for SD as SS
static const uint8_t MOSI = 11;
static const uint8_t MISO = 12;
static const uint8_t SCK  = 13;

static const uint8_t SDA = 18;
static const uint8_t SCL = 19;
#ifndef __RX600__
#define LED_BUILTIN 13
#endif/*__RX600__*/

static const uint8_t A0 = 14;
static const uint8_t A1 = 15;
static const uint8_t A2 = 16;
static const uint8_t A3 = 17;
#ifndef GRCITRUS
static const uint8_t A4 = 18;
static const uint8_t A5 = 19;
static const uint8_t A6 = 20;
static const uint8_t A7 = 21;
#endif

#ifdef __RX600__
/** IO pins, header CN8. */
#define PIN_IO0     0
#define PIN_IO1     1
#define PIN_IO2     2
#define PIN_IO3     3
#define PIN_IO4     4
#define PIN_IO5     5
#define PIN_IO6     6
#define PIN_IO7     7

/** IO pins, header CN7. */
#define PIN_IO8     8
#define PIN_IO9     9
#define PIN_IO10    10
#define PIN_IO11    11
#define PIN_IO12    12
#define PIN_IO13    13

/** IO pins, header CN7. */
#define PIN_IO14    14
#define PIN_IO15    15
#define PIN_IO16    16
#define PIN_IO17    17
#define PIN_IO18    18
#define PIN_IO19    19
#define PIN_IO20    20
#define PIN_IO21    21

/** IO pins, header CN9. */
#define PIN_IO22    22
#define PIN_IO23    23
#define PIN_IO24    24
#define PIN_IO25    25
#define PIN_IO26    26
#define PIN_IO27    27
#define PIN_IO28    28
#define PIN_IO29    29

/** IO pins, header CN10. */
#define PIN_IO30    30
#define PIN_IO31    31
#define PIN_IO32    32
#define PIN_IO33    33
#define PIN_IO34    34
#define PIN_IO35    35

/** IO pins, header CN12. */
#define PIN_IO36    36
#define PIN_IO37    37
#define PIN_IO38    38
#define PIN_IO39    39
#define PIN_IO40    40
#define PIN_IO41    41
#define PIN_IO42    42
#define PIN_IO43    43

/** IO pins, header CN11. */
#define PIN_IO44    44
#define PIN_IO45    45
#define PIN_IO46    46
#define PIN_IO47    47
#define PIN_IO48    48
#define PIN_IO49    49
#define PIN_IO50    50
#define PIN_IO51    51

/** IO pins, header CN13. */
#define PIN_IO52    52
#define PIN_IO53    53
#define PIN_IO54    54
#define PIN_IO55    55

/** IO pins, header CN6. */
#define PIN_IO56    56
#define PIN_IO57    57
#define PIN_IO58    58
#define PIN_IO59    59
#define PIN_IO60    60

/** LEDs (D1-D4) and SW. */
#define PIN_LED0    61
#define PIN_LED1    62
#define PIN_LED2    63
#define PIN_LED3    64
#define PIN_SW      65

// ANALOG IO PINS -------------------------------------------------------------/

/** Analog pins, header CN15. */
#define PIN_AN000     14
#define PIN_AN001     15
#define PIN_AN002     16
#define PIN_AN003     17
#define PIN_AN004     18
#define PIN_AN005     19

/** Analog pins, header CN13. */
#define PIN_AN006     20
#define PIN_AN007     21

/** Analog pins, header CN12. */
#ifdef GRSAKURA
#define PIN_AN008     36
#define PIN_AN009     37
#define PIN_AN010     38
#define PIN_AN011     39
#define PIN_AN012     40
#define PIN_AN013     41
#elif defined(GRCITRUS)
#define PIN_AN008     22
#define PIN_AN009     23
#define PIN_AN010     24
#define PIN_AN011     25
#define PIN_AN012     26
#define PIN_AN013     27
#endif

/** Analog input, RX63N internal */
#define PIN_ANINT     28
#define PIN_ANTMP     29
#endif/*__RX600__*/

#ifdef __RX600__
#define digitalPinToPCICR(p)    (((p) >= 0 && (p) <= 21) ? (&PCICR) : ((uint8_t *)0))
#define digitalPinToPCICRbit(p) (((p) <= 7) ? 2 : (((p) <= 13) ? 0 : 1))
#define digitalPinToPCMSK(p)    (((p) <= 7) ? (&PCMSK2) : (((p) <= 13) ? (&PCMSK0) : (((p) <= 21) ? (&PCMSK1) : ((uint8_t *)0))))
#define digitalPinToPCMSKbit(p) (((p) <= 7) ? (p) : (((p) <= 13) ? ((p) - 8) : ((p) - 14)))
#endif/*__RX600__*/

#define digitalPinToInterrupt(p)  ((p) == 2 ? 0 : ((p) == 3 ? 1 : NOT_AN_INTERRUPT))

#ifdef ARDUINO_MAIN

// On the Arduino board, digital pins are also used
// for the analog output (software PWM).  Analog input
// pins are a separate set.

// ATMEL ATMEGA8 & 168 / ARDUINO
//
//                  +-\/-+
//            PC6  1|    |28  PC5 (AI 5)
//      (D 0) PD0  2|    |27  PC4 (AI 4)
//      (D 1) PD1  3|    |26  PC3 (AI 3)
//      (D 2) PD2  4|    |25  PC2 (AI 2)
// PWM+ (D 3) PD3  5|    |24  PC1 (AI 1)
//      (D 4) PD4  6|    |23  PC0 (AI 0)
//            VCC  7|    |22  GND
//            GND  8|    |21  AREF
//            PB6  9|    |20  AVCC
//            PB7 10|    |19  PB5 (D 13)
// PWM+ (D 5) PD5 11|    |18  PB4 (D 12)
// PWM+ (D 6) PD6 12|    |17  PB3 (D 11) PWM
//      (D 7) PD7 13|    |16  PB2 (D 10) PWM
//      (D 8) PB0 14|    |15  PB1 (D 9) PWM
//                  +----+
//
// (PWM+ indicates the additional PWM pins on the ATmega168.)

